/*
설정

이름 작성 - 오브젝트 : 시작글자 대문자. 중간글자 대문자. 언더바 미사용.
		 - 함수 : 시작글자 대문자. 중간글자 소문자. 언더바 사용.
		 - 변수 : 시작글자 소문자. 중간글자 소문자. 언더바 사용. 

몬스터 AI
- 접근 
	1. 뛰어가기.
	2. 대기하기
	3. 걸어가기.
	4. 마법 사용. - 법사 전용.
-공격
	1. 단순공격
	2. 1회 방어 1회 공격
	3. 무작위 공격 방어.
	
몬스터 종류
-해골 병사
	시야 : 80
	사거리 : 8
	이동 속도 : 30
	공격력 : 3
	공격 속도 : 0.7
-해골 전사
	시야 : 100
	사거리 : 8
	이동 속도 : 20
	공격력 : 6
	공격 속도 : 0.9
-해골 창사
	시야 : 80
	사거리 : 12
	이동 속도 : 20
	공격력 : 4
	공격 속도 : 0.8
-해골 법사
	시야 : 150
	사거리 : 10
	이동 속도 : 15
	공격력 : 1
	공격 속도 : 0.5
	마법 공격력 : 10

지형

1133 - 1200 : 속도 느려짐.
1430 - 1442 : 0.5초마다 데미지 받음.
1480 - 1492 : 0.5초마다 데미지 받음.

배치 

법사
(879, 3.6)
(1217.3, 1.4)
(1577, 0.2)

병사 
(238.6, 0)
(362.5, 0)
(444.4, 0)
(511.6, 0)
(1098, 1)
(1308.4, 1)

전사
(613, 0)
(801.5, 3.8)
(985.5, 0)
(1464, 0)
(1551, 0)

창사
(753.8, 2)
(1182.7, 0.5)

*/